{
    "Root": [
        {
            "Ctype": "展示中心",
            "Data": [
                {
                    "City": "台北",
                    "Town": [
                        "台北-1",
                        "台北-2"
                    ]
                },
                {
                    "City": "台中",
                    "Town": [
                        "台中-1",
                        "台中-2"
                    ]
                }
            ]
        },
        {
            "Ctype": "保修廠",
            "Data": [
                {
                    "City": "花蓮",
                    "Town": [
                        "花蓮-1",
                        "花蓮-2"
                    ]
                },
                {
                    "City": "台中",
                    "Town": [
                        "台中-1",
                        "台中-2"
                    ]
                }
            ]
        },
        {
            "Ctype": "展示中心+保修廠",
            "Data": [
                {
                    "City": "台中",
                    "Town": [
                        "台中-1",
                        "台中-2"
                    ]
                }
            ]
        }
    ]
}
